Тест/Тест/src/Documents/ПрочиеДоходы/ПрочиеДоходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрочиеДоходы</name>
  <basedOn>Document.ПоступлениеЗапчастей</basedOn>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеТМЦВорктрак</registerRecords>
  <attributes>
    <name>ВидДохода</name>
    <type>
      <types>EnumRef.ВидыПрочихДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПлатежа</name>
    <type>
      <types>EnumRef.ПериодПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействующийДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПродажиТМЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаАренда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТМЦИмущество</name>
    <type>
      <types>CatalogRef.ТМЦВорктрак</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникКлиент</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплатыПрочиеДоходы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.ИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХраненияТМЦ</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Enums/ВидыПрочихДоходов/ВидыПрочихДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрочихДоходов</name>
  <enumValues>
    <name>АрендаИмущества</name>
  </enumValues>
  <enumValues>
    <name>АрендаТМЦ</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПоставщика</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Enums/ТипОплатыПрочиеДоходы/ТипОплатыПрочиеДоходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОплатыПрочиеДоходы</name>
  <enumValues>
    <name>ИзЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>НаСчет</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Documents/ПриходДенегНаСчет/ПриходДенегНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенегНаСчет</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <basedOn>Document.ЗаказНаДоставку</basedOn>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ОплатыПоСделкам</registerRecords>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.БаланПоНакладной</registerRecords>
  <registerRecords>AccumulationRegister.БалансКлиента</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.ЗаказНаДоставку</types>
      <types>DocumentRef.ЗаказНаряд</types>
      <types>DocumentRef.ПрочиеДоходы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>EnumRef.ВидыПоступлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
        <types>DocumentRef.ЗаказНаДоставку</types>
        <types>DocumentRef.ЗаказНаряд</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.Счета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Documents/ПрочиеДоходы/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТМЦНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.ТМЦВорктрак.Форма.ФормаВыбораДополнительная",ПараметрыФормы, ЭтаФорма,, ЭтаФорма.Окно); 
	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ссылка) тогда 
			СписокПоступлениеДС.Параметры.УстановитьЗначениеПараметра("СсылкаСделка",Объект.Ссылка);
			Объект.СуммаДокументаАренда = ПодсчетСуммыСписокПоступлениеДС();  
//	Иначе 	СписокПоступлениеДС.Параметры.УстановитьЗначениеПараметра("СсылкаСделка",Неопределено); 
	КонецЕсли;
	
	Если Объект.ТМЦ.Количество()<>0 Тогда 
		Элементы.СуммаПродажиТМЦ.Видимость = Истина; 
	Иначе 
		Элементы.СуммаПродажиТМЦ.Видимость = ложь; 
	КонецЕсли; 

	СкрытьИлиПоказатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ТМЦВорктрак") Тогда
	
		ИмяТабличнойЧасти = "ТМЦ";	
		Элементы[ИмяТабличнойЧасти].ТекущиеДанные.Наименование = ВыбранноеЗначение;
	
	КонецЕСли; 


КонецПроцедуры




&Насервере
Процедура СкрытьИлиПоказатьСумму()
	Если Объект.ВидДохода = Перечисления.ВидыПрочихДоходов.АрендаИмущества ИЛИ  Объект.ВидДохода = Перечисления.ВидыПрочихДоходов.АрендаТМЦ Тогда 
		элементы.СуммаПродажиТМЦ.Видимость 		= Ложь; 
		Элементы.СуммаДокументаАренда.видимость = Истина;
		Элементы.СуммаПлатежа.Видимость 		= Истина; 
		Элементы.ТМЦИмущество.Видимость 		= Истина;
		Элементы.Клиент.Видимость 				= Истина;
		Элементы.СотрудникКлиент.Видимость 		= Ложь; 
		Элементы.Сделка.Видимость 				= Ложь; 
		Элементы.ДатаНачалаДоговора.Видимость 	= ложь; 
		Элементы.ДатаОкончанияДоговора.Видимость = ложь;
		Элементы.ПериодПлатежа.Видимость 		= ложь; 
		Элементы.ТипОплаты.Видимость			= Ложь;  
	иначеЕсли Объект.ВидДохода = Перечисления.ВидыПрочихДоходов.ВнутренняяПродажа Тогда
		элементы.СуммаПродажиТМЦ.Видимость 		= Истина;  
		Элементы.СуммаДокументаАренда.видимость = Ложь; 
		Элементы.СуммаПлатежа.Видимость 		= Ложь; 
		Элементы.ТМЦИмущество.Видимость 		= ложь;
		Элементы.Клиент.Видимость 				= Ложь;
		Элементы.СотрудникКлиент.Видимость 		= Истина; 
		Элементы.Сделка.Видимость 				= Ложь;
		Элементы.ДатаНачалаДоговора.Видимость 	= ложь; 
		Элементы.ДатаОкончанияДоговора.Видимость = ложь;
		Элементы.ПериодПлатежа.Видимость 		= ложь; 
		Элементы.ТипОплаты.Видимость			= Истина; 
	КонецЕсли;
	
	Если Объект.ВидДохода = Перечисления.ВидыПрочихДоходов.ВозвратОтПоставщика Тогда
		элементы.СуммаПродажиТМЦ.Видимость 		= Ложь; 
		Элементы.СуммаДокументаАренда.видимость = Ложь;
		Элементы.СуммаПлатежа.Видимость 		= Истина; 
		Элементы.ТМЦИмущество.Видимость 		= Ложь;
		Элементы.Клиент.Видимость 				= Истина;
		Элементы.СотрудникКлиент.Видимость 		= Ложь;  
		Элементы.Сделка.Видимость 				= Истина;
		Элементы.ТипОплаты.Видимость			= ложь;  
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОплатыПриИзменении(Элемент)
	
	
	Если ТипОплатыПриИзмененииНаСервере() Тогда 
		Элементы.Счет.Видимость = Ложь; 
	Иначе 
		Элементы.Счет.Видимость = истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТипОплатыПриИзмененииНаСервере()
	
	Если объект.ТипОплаты = Перечисления.ТипОплатыПрочиеДоходы.ИзЗарплаты Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ТМЦСтоимостьПриИзменении(Элемент)
	РассчётСуммыТМЦ();
КонецПроцедуры

&НаКлиенте
Процедура ТМЦКоличествоПриИзменении(Элемент)
	РассчётСуммыТМЦ();
КонецПроцедуры

&НаКлиенте
Процедура РассчётСуммыТМЦ()
	СтрокаТабличнойЧасти = Элементы.ТМЦ.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Стоимость;
КонецПроцедуры


&НаКлиенте
Процедура ТМЦПриАктивизацииСтроки(Элемент)
	Если Объект.ТМЦ.Количество()<>0 Тогда 
		ТекДанные = Элементы.ТМЦ.ТекущиеДанные; 
		СписокИндНомер.Параметры.УстановитьЗначениеПараметра("Владелец",ТекДанные.Наименование);	
		Иначе
		СписокИндНомер.Параметры.УстановитьЗначениеПараметра("Владелец", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоходаПриИзменении(Элемент)
	СкрытьИлиПоказатьСумму(); 
КонецПроцедуры



&НаКлиенте
Процедура ТМЦИнвентарныйНомерПриИзменении(Элемент)
ТекДанные = Элементы.ТМЦ.ТекущиеДанные; 
Структура = ТМЦИнвентарныйНомерПриИзмененииНаСервере(ТекДанные.ИнвентарныйНомер);
ТекДанные.Стоимость = Структура.Стоимость; 
ТекДанные.Код = Структура.Код;  
КонецПроцедуры



&НаСервере
Функция ТМЦИнвентарныйНомерПриИзмененииНаСервере(Наименование)
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнвентарныеНомера.Стоимость,
	|	ИнвентарныеНомера.Код
	|ИЗ
	|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
	|ГДЕ
	|	ИнвентарныеНомера.Наименование = &Наименование";

Запрос.УстановитьПараметр("Наименование", Наименование);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Структура = Новый Структура; 
Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Структура.Вставить("Стоимость",ВыборкаДетальныеЗаписи.Стоимость );
	Структура.Вставить("Код",ВыборкаДетальныеЗаписи.Код );
КонецЦикла;
Возврат Структура; 
КонецФункции
&НаКлиенте

Процедура ТМЦПриИзменении(Элемент)
	Элементы.СуммаПродажиТМЦ.Видимость = Ложь; 
	Если Объект.ТМЦ.Количество()>0 Тогда 
		Элементы.СуммаПродажиТМЦ.Видимость = Истина; 
		Объект.СуммаПродажиТМЦ = 0; 
		Для каждого Строка Из Объект.ТМЦ Цикл 
			Объект.СуммаПродажиТМЦ = Объект.СуммаПродажиТМЦ + Строка.Сумма;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТМЦНаименованиеПриИзменении(Элемент)
		Если Объект.ТМЦ.Количество()>0 Тогда 
		ТекДанные = Элементы.ТМЦ.ТекущиеДанные; 
		СписокИндНомер.Параметры.УстановитьЗначениеПараметра("Владелец",ТекДанные.Наименование);
		Иначе
		СписокИндНомер.Параметры.УстановитьЗначениеПараметра("Владелец", Неопределено);	
	КонецЕсли;
КонецПроцедуры
// Подсчет суммы динамического списка с пиходоми денег на счет 
Функция ПодсчетСуммыСписокПоступлениеДС() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходДенегНаСчет.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
		|ГДЕ
		|	ПриходДенегНаСчет.Сделка = &СсылкаСделка";
	
	Запрос.УстановитьПараметр("СсылкаСделка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Сумма = 0; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма= Сумма +  ВыборкаДетальныеЗаписи.СуммаДокумента; 
	КонецЦикла;
	
	Возврат Сумма;
КонецФункции


Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	  НепроверяемыеРеквизиты = Новый Массив();

  // Проверка значения реквизита на соответствие некоторым требованиям
  Если НЕ ЗначениеЗаполнено(Объект.ТипОплаты) Тогда
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Тип оплаты не задан.'");
    Сообщение.Сообщить();
    Отказ = Истина; 
    НепроверяемыеРеквизиты.Добавить("ТипОплаты"); 
  КонецЕсли;
  
  УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры
